external_ssiuss/soap

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:mp="http://schemas.datastream.net/MP_functions/MP0241_001"
                  xmlns:dsf="http://schemas.datastream.net/MP_fields">
  <soapenv:Header>
    <Security xmlns="http://schemas.xmlsoap.org/ws/2002/04/secext">
      <UsernameToken>
        <Username>ACOSTA@IBNQI1720580460_DEM</Username>
        <Password>Asset@25</Password>
      </UsernameToken>
    </Security>
    <SessionScenario xmlns="http://schemas.datastream.net/headers">create</SessionScenario>
    <Organization xmlns="http://schemas.datastream.net/headers">TROMB-03</Organization>
  </soapenv:Header>

  <soapenv:Body>
    <mp:MP0241_GetPart_001 verb="Get" noun="Part" version="001">
      <dsf:PARTID>
        <dsf:PARTCODE>10825</dsf:PARTCODE>
        <dsf:ORGANIZATIONID entity="User">
          <dsf:ORGANIZATIONCODE>TROMB-03</dsf:ORGANIZATIONCODE>
        </dsf:ORGANIZATIONID>
      </dsf:PARTID>
    </mp:MP0241_GetPart_001>
  </soapenv:Body>
</soapenv:Envelope>


// concertar. 
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <Security xmlns="http://schemas.xmlsoap.org/ws/2002/04/secext">
      <UsernameToken>
        <Username>ACOSTA@IBNQI1720580460_DEM</Username>
        <Password>Asset@25</Password>
      </UsernameToken>
    </Security>
    <SessionScenario xmlns="http://schemas.datastream.net/headers">create</SessionScenario>
    <Organization xmlns="http://schemas.datastream.net/headers">TROMB-03</Organization>
  </soapenv:Header>
  <soapenv:Body>
    <MP0278_GetPartPrices_001 xmlns="http://schemas.datastream.net/MP_functions/MP0278_001"
                              verb="Get"
                              noun="PartPrices"
                              version="001">
      <PARTPRICESID xmlns="http://schemas.datastream.net/MP_fields">
        <PARTID>
          <PARTCODE>10825</PARTCODE>
          <ORGANIZATIONID>
            <ORGANIZATIONCODE>TROMB-03</ORGANIZATIONCODE>
          </ORGANIZATIONID>
        </PARTID>
        <ORGANIZATIONID>
          <ORGANIZATIONCODE>ALMTROMB</ORGANIZATIONCODE>
        </ORGANIZATIONID>
      </PARTPRICESID>
    </MP0278_GetPartPrices_001>
  </soapenv:Body>
</soapenv:Envelope>

// concertar
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:mp="http://schemas.datastream.net/MP_functions/MP0278_001"
                  xmlns:fld="http://schemas.datastream.net/MP_fields">
   <soapenv:Header>
      <Security xmlns="http://schemas.xmlsoap.org/ws/2002/04/secext">
         <UsernameToken>
            <Username>ACOSTA@IBNQI1720580460_DEM</Username>
            <Password>Asset@25</Password>
         </UsernameToken>
      </Security>
      <Organization xmlns="http://schemas.datastream.net/headers">TROMB-03</Organization>
      <SessionScenario xmlns="http://schemas.datastream.net/headers">create</SessionScenario>
   </soapenv:Header>
   <soapenv:Body>
      <mp:MP0278_GetPartPrices_001 verb="Get" noun="PartPrices" version="001">
         <fld:PARTPRICESID>
            <fld:PARTID>
               <fld:PARTCODE>10825</fld:PARTCODE>
               <fld:ORGANIZATIONID>
                  <fld:ORGANIZATIONCODE>TESTE2</fld:ORGANIZATIONCODE>
               </fld:ORGANIZATIONID>
            </fld:PARTID>
         </fld:PARTPRICESID>
      </mp:MP0278_GetPartPrices_001>
   </soapenv:Body>
</soapenv:Envelope>
